Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionPlacingAttributes.Placing Property
 The placing type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes.Placings Placing { get; set; }
Public Property Placing As DimensionSetBaseAttributes.Placings
	Get
	Set
Property Value
Type: DimensionSetBaseAttributes.Placings
See Also
Reference
DimensionSetBaseAttributes.DimensionPlacingAttributes Class
Tekla.Structures.Drawing Namespace